

const multer = require("multer") // دة باكجيج اللى مستخدم يسمح مستخدم ينزل صورة لهو

// cloudinary دة موقع كبير بيسمحلك تخزن صورة على النت وعشان تكلموة محتاج تربط بالبكاجيج الللى فوق والباكيج ومحتاج تكلم حد عشان يكلم باكيج فوق


const {CloudinaryStorage} = require("multer-storage-cloudinary")

// دة باكيج الوسيط اللى هيسمح نكلم باكجيج ميلتر ونكلم موقع كيلودرنري

// multer =>>>> CloudinaryStorage=>>>> cloudinary 

// multer دة باكيج هيسمح مستخدم يحط صورتة بروفايل او يغيرها


// CloudinaryStorage دة باكيجيج وسيط بينقل الصورة اللى مستخدم يغيرة لسيرفر موقع بتاع كيلودرنري حطينها في اوبجكيت عشان خاطر احنا عايزين خاصية دي فقط مش عايزين اي حاجة من باكيج

// cloudinary دة الموقع او سيرفر بيخزن الصورة اللى جت عن طريق باكيج وسيط اللى فوقك دة


const cloudinary = require("../config/cloudinary") // دة باسورد ومفتاح ايبي وكلة حاجة عملناها في صفحة قبل كدة


// هنستخدم بقي بكاجيج الوسيط مابينهم ونحط متغير كيلودرنري دة فية عشان نربطة ونقولة نحددلوة ان صيغة تكون صورة يعني لو بيدف مترفعوش


const storages = new CloudinaryStorage({

cloudinary: cloudinary , 

params:{

  folder : "coffe-store",

  allowed_formats:["jpg" , "png" , "webp" , "jpeg"]
}

})




// بعد كدة هنعمل متغير نخزن فية الصورة دي عشان خاطر نستخدمة في كل روتيس ويخلي ميلتر يسمحلوة بالصورة 


const upload = multer({storage : storages})

// multer بيستقبل الصورة اللى جاية من المستخدم عشان كدة قولتلوة بعد ماخلصت وربط كل حاجة قولتلوة خزنزلي صور دي بقي بصيغة كذا 



module.exports = upload


// req.file  الصورة بتترفع ع شكل فايل من خلال ميلتر لما يستقبلها بيستقبلها على شكل فايل اوبحكيت فيها تفاصيل صورة اسم صورة حجمها وكدة بعد كدة بتروح تخزنها في كلويندري يرجعهالك على شكل يو ار ال والايدي بتاع صورة متخزن في كلويندري 



// اول حاجة المستخدم يرفع الصورة في فروند اند او بوست مان 

// mutler تاني حاجة ميلتر يستقبلها 

// cloudinary بعد ما تعمل اتصال مابين ميلتر وكلويندري وتربطهم بعض ثم بعد كدة الصورة تتخزن في كلويندري

// url بعد ما الصورة ببتخزن في كلويندر بتتخز على شكل لينك

// بعد كدة بيتخزن علي هيئة لينك في كوليندري وانت تقدر تتسدعية هنا وتخزنة في مونجو ديبي


// Frontend / Postman
//         ↓
//      Multer (req.file)
//         ↓ 
//    Backend Node.js
//         ↓
//    Cloudinary upload
//         ↓
//   secure_url (link)
//         ↓
//    MongoDB (save URL)























